# Day4 データの整理 - PandasPandasで表形式のデータ構造を作ろう

In [1]:
#ライブラリのインポート
import pandas as pd
import numpy as np

# データフレームの作成

In [2]:
#データフレームの作成
#手動でデータフレームを作成
df = pd.DataFrame({'Age':[12,14,12,18],
                   #'表の項目':[表の要素]
                   'Gender':['M','M','F','F'],
                   'Height':[150,160,150,175], 
                   'Weight': [35,50,36,60]})
df

   Age Gender  Height  Weight
0   12      M     150      35
1   14      M     160      50
2   12      F     150      36
3   18      F     175      60

In [3]:
#dfの概要を出す
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     4 non-null      int64
 1   Gender  4 non-null      object
 2   Height  4 non-null      int64
 3   Weight  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

In [4]:
# dfのindex前から二つを表示する
df.head(2)

   Age Gender  Height  Weight
0   12      M     150      35
1   14      M     160      50

In [5]:
# dfのindex後ろから二つを表示する
df.tail(2)

   Age Gender  Height  Weight
2   12      F     150      36
3   18      F     175      60

In [6]:
#全ての列の名前を出す
df.columns

Index(['Age', 'Gender', 'Height', 'Weight'], dtype='object')

In [7]:
#全てのindexを出す
df.index

RangeIndex(start=0, stop=4, step=1)

# データフレームの基本的な性質

Kaggleよりデータをダウンロードします \
https://www.kaggle.com/competitions/titanic/data?select=train.csv

わかりやすく"titanic_train.csv"と名前を変えました

In [8]:
# csvファイルの読み込み、データフレームを作成する
df_titanic = pd.read_csv('titanic_train.csv')

In [9]:
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
#最初の５行を取得
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
#概要を表示
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# データフレームの基本的な操作

In [13]:
# indexに名前を付ける
df.index = ['Taro','Jiro','Hana','Ayumi']
print(df)
print(df.index)

       Age Gender  Height  Weight
Taro    12      M     150      35
Jiro    14      M     160      50
Hana    12      F     150      36
Ayumi   18      F     175      60
Index(['Taro', 'Jiro', 'Hana', 'Ayumi'], dtype='object')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Taro to Ayumi
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     4 non-null      int64
 1   Gender  4 non-null      object
 2   Height  4 non-null      int64
 3   Weight  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 160.0+ bytes

In [15]:
#特定の列と行だけ名前を変更する
#Gender→Sex，Taro→Goro
df = df.rename(columns={'Gender':'Sex'}, index={'Taro':'Goro'})
df

       Age Sex  Height  Weight
Goro    12   M     150      35
Jiro    14   M     160      50
Hana    12   F     150      36
Ayumi   18   F     175      60

In [16]:
#新しい列の追加，cityという項目でその要素を追加
df['City'] = ['Tokyo','Kyoto','Okinawa','Hakata']
df

       Age Sex  Height  Weight     City
Goro    12   M     150      35    Tokyo
Jiro    14   M     160      50    Kyoto
Hana    12   F     150      36  Okinawa
Ayumi   18   F     175      60   Hakata

In [17]:
#列を削除，columnsというパラメータで指定
df = df.drop(columns='City')
df

       Age Sex  Height  Weight
Goro    12   M     150      35
Jiro    14   M     160      50
Hana    12   F     150      36
Ayumi   18   F     175      60

# データフレームの参照

In [18]:
#列名を指定してデータを参照してみます
df['Age']

Goro     12
Jiro     14
Hana     12
Ayumi    18
Name: Age, dtype: int64

In [19]:
# df['Age'] と同じ意味
df.Age

Goro     12
Jiro     14
Hana     12
Ayumi    18
Name: Age, dtype: int64

In [20]:
#２列同時に参照する
df[['Age', 'Sex']]

       Age Sex
Goro    12   M
Jiro    14   M
Hana    12   F
Ayumi   18   F

In [21]:
# .loc[]は行を指定してデータを参照するときに使う
df.loc['Goro']

Age        12
Sex         M
Height    150
Weight     35
Name: Goro, dtype: object

In [22]:
#インデックスと列名を同時に指定して参照する
df.loc['Goro','Age']

12

In [23]:
#複数のデータを取り出す
#全ての行のAgeとSexを取り出す
df.loc[:, ["Age","Sex"]]

       Age Sex
Goro    12   M
Jiro    14   M
Hana    12   F
Ayumi   18   F

In [24]:
df.loc[["Jiro","Hana"], :]
#df.loc[["Jiro","Hana"]]でも同じ

      Age Sex  Height  Weight
Jiro   14   M     160      50
Hana   12   F     150      36

In [25]:
#条件を満たすデータを取り出す
# Ageが12より大きい行を取り出す。
df[df['Age']>12]

       Age Sex  Height  Weight
Jiro    14   M     160      50
Ayumi   18   F     175      60

In [26]:
# df['Age']>12 を満たす行を取り出し、列は["Height", "Weight"]だけ表示する
df.loc[df['Age']>12, ["Height", "Weight"]]

       Height  Weight
Jiro      160      50
Ayumi     175      60

In [27]:
#データを並び替える
#ascendingは上昇の意味
df.sort_values('Age', ascending=True)
#昇順の時ascendingはなくても良い

       Age Sex  Height  Weight
Goro    12   M     150      35
Hana    12   F     150      36
Jiro    14   M     160      50
Ayumi   18   F     175      60

In [28]:
df.sort_values('Age', ascending=False)

       Age Sex  Height  Weight
Ayumi   18   F     175      60
Jiro    14   M     160      50
Goro    12   M     150      35
Hana    12   F     150      36

In [29]:
#性別で並べ替えてから年齢で並べる
#F>Mの順でSexを並べ、F, Mのそれぞれで年齢順に並べている
df.sort_values(['Sex','Age'])

       Age Sex  Height  Weight
Hana    12   F     150      36
Ayumi   18   F     175      60
Goro    12   M     150      35
Jiro    14   M     160      50

In [30]:
# Sex列に存在するユニークな値とその出現回数を求める
df["Sex"].value_counts()

M    2
F    2
Name: Sex, dtype: int64

In [31]:
# 性別毎に集計をして、各列の平均を求める
df.groupby("Sex").mean()

      Age  Height  Weight
Sex
F    15.0   162.5    48.0
M    13.0   155.0    42.5

# データフレーム参照　演習

titanic_train.csvのデータセットに関して\
問題1\
データを年齢の降順に並べよ

問題2\
年齢が40歳未満の男性のデータを取り出せ

In [ ]:
df_titanic = pd.read_csv('titanic_train.csv')

答え（問題1)
<!--
# Age列で並べ替え
# 降順：ascending = False
df_titanic.sort_values('Age',ascending=False)
-->

答え（問題2)
<!--
# 年齢が40未満の男性データを取り出してみよう
# 条件を一つずつ適応していく
df_temp = df_titanic[ df_titanic['Age'] < 40 ]
df_temp = df_temp[ df_temp['Sex']=='male']
df_temp

#別解
df_titanic[ (df_titanic['Age']<40) & (df_titanic["Sex"] == "male") ]
-->

# データフレームの加工

In [32]:
print(df)
df['Age'] += 1
print(df)
#データの参照の方法を用いて特定のデータ、複数のデータの演算を行ってみましょう

       Age Sex  Height  Weight
Goro    12   M     150      35
Jiro    14   M     160      50
Hana    12   F     150      36
Ayumi   18   F     175      60
       Age Sex  Height  Weight
Goro    13   M     150      35
Jiro    15   M     160      50
Hana    13   F     150      36
Ayumi   19   F     175      60

In [33]:
#基本統計量を出す
#最大値
print(df.loc[:,'Weight'].max())
#中央値
print(df.loc[:,'Weight'].median())
#最小値
print(df.loc[:,'Weight'].min())

60
43.0
35

In [34]:
#基本統計量をまとめて出す
#.discribe()がめっちゃ便利
print(df.loc[:,'Weight'].describe())

count     4.000000
mean     45.250000
std      11.982626
min      35.000000
25%      35.750000
50%      43.000000
75%      52.500000
max      60.000000
Name: Weight, dtype: float64

In [35]:
df.describe()

             Age      Height     Weight
count   4.000000    4.000000   4.000000
mean   15.000000  158.750000  45.250000
std     2.828427   11.814539  11.982626
min    13.000000  150.000000  35.000000
25%    13.000000  150.000000  35.750000
50%    14.000000  155.000000  43.000000
75%    16.000000  163.750000  52.500000
max    19.000000  175.000000  60.000000

# データフレームの加工演習

問題1\
データセットの「Age」の統計情報を出せ

問題2\
「Age」の要素に20を足せ

問題3\
「Survived」はその乗客の「生存 or 死亡」を表している。\
生存した乗客の数を表せ。\
Survivedにおいて死亡は0、生存は1で表されている。

答え（問題1)
<!--
#年齢のまとめ統計情報
df_titanic.loc[:,'Age'].describe()
-->

答え（問題2)
<!--
#年齢を全部足す20
df_titanic.loc[:,'Age'] += 20
df_titanic
-->

答え（問題3)
<!--
df_titanic["Survived"].value_counts()

#sumを使うのもアリ
#生存:1を全部足す
df_titanic.loc[ :,'Survived'].sum()
-->

# 欠損値処理

In [36]:
#欠損したデータフレーム
df = pd.DataFrame({'Age':[12,14,12,18],
                   'Gender':['M','M','F','F'],
                   'Height':[np.nan,160,150,175], 
                   'Weight': [35,50,np.nan,60]})
df

   Age Gender  Height  Weight
0   12      M     NaN    35.0
1   14      M   160.0    50.0
2   12      F   150.0     NaN
3   18      F   175.0    60.0

In [37]:
#Isnull関数を用いて欠損値の存在を確認
#欠損値ならばTrueが表示される
df.isnull()

     Age  Gender  Height  Weight
0  False   False    True   False
1  False   False   False   False
2  False   False   False    True
3  False   False   False   False

In [38]:
#欠損値の数を数える
df.isnull().sum()

Age       0
Gender    0
Height    1
Weight    1
dtype: int64

In [39]:
#dropna関数は欠損値の行を削除する
#インデックスが2, 4の行に欠損値含まれるのでそれらを削除
df_dropna = df.dropna()
df_dropna

   Age Gender  Height  Weight
1   14      M   160.0    50.0
3   18      F   175.0    60.0

In [40]:
#fillna関数を用いて平均値で欠損値を置き換え
df_fillna = df.fillna(df.mean())
df_fillna

/Users/tomiokakotaro/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.

   Age Gender      Height     Weight
0   12      M  161.666667  35.000000
1   14      M  160.000000  50.000000
2   12      F  150.000000  48.333333
3   18      F  175.000000  60.000000

# データフレームの基本的な操作

In [41]:
#最後の行に追加
new_row=pd.DataFrame([[15,"F",154,49]],
                     index=[4],
                     columns=["Age","Gender","Height","Weight"])
new_row

   Age Gender  Height  Weight
4   15      F     154      49

In [42]:
#新しい行と既存の表dfを結合する
#axisは結合の方向，0で縦方向に結合，1で横方向に結合
new_df=pd.concat([df,new_row],axis=0)
new_df

   Age Gender  Height  Weight
0   12      M     NaN    35.0
1   14      M   160.0    50.0
2   12      F   150.0     NaN
3   18      F   175.0    60.0
4   15      F   154.0    49.0

In [43]:
#列の削除
df_titanic.drop(columns='Cabin')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

# 欠損値処理　演習

titanic_train.csvのデータに関して\
問題1\
欠損値の有無を確認しよう

問題2\
欠損値のある行を削除しよう

答え
<!--
問題1
#  欠損値の有無を出力
df_titanic.isnull() #Trueの部分が欠損
df_titanic.isnull().sum() #欠損値の数が分かるので便利.

問題2
#欠損を含む行を削除
df_titanic.dropna()
-->